//=================================================================================================================
//※ 아이템 리스트 - 관련 함수
//=================================================================================================================
	//항목 탐색
	function indexItem(name, wantType) {
		var arr = itemList;
		
		for (var i=0;i<arr.length;i++) {
			if (arr[i][0] == name) {
				switch (wantType) {
					case "name":
						return arr[i][1];
					case "image":
						return arr[i][2];
					case "quantity":
						return arr[i][3];
					case "description":
						return arr[i][5];
				}
			}
		}
	}

	//수량 변경
	function setItem(name, changeQuantity) {
		var arr = itemList;
		
		for (var i=0;i<arr.length;i++) {
			if (arr[i][0] == name) {
				switch (changeQuantity.substring(0,1)) {
					case ("+"):
						arr[i][3] += parseInt(changeQuantity.substring(1));
						
						break;
					case ("-"):
						arr[i][3] -= parseInt(changeQuantity.substring(1).toString());
						
						break;
					case ("="):
						arr[i][3] = parseInt(changeQuantity.substring(1).toString());
						
						break;
				}
			}
		}
	}
//=================================================================================================================
//※ 아이템 리스트 - 자료
//=================================================================================================================
var itemList = [//
//※ itemList[0] : 입력 이름 (검색용)
//※ itemList[1] : 출력 이름
//※ itemList[2] : 이미지 파일 이름
//※ itemList[3] : 보유량
//※ itemList[4] : 아이템 효과
//※ itemList[5] : 설명
//==========================================================================================
//※ A. 분류 1
//==========================================================================================
["골드","Gold","gold",0,"","화폐"],
//==========================================================================================
//※ B. 분류 2
//==========================================================================================
["초대장","지옥파티 초대장","invitation",0,"","지옥파티 입장에 필요"],








["","","",,"",""]];